# 简单的增删改查

对数据库的增删改查操作是最常见的需求,这实际上是两种操作:

+ 写操作: INSERT,UPDATE,DELETE
+ 读操作: SELECT

本文将主要介绍写操作和简单读操作.复杂查询会是这个系列文章的重点,会按不同的操作在后面的文章中分开讲解.

In [1]:
-- connection: postgres://postgres:postgres@localhost:5432/postgres

In [2]:
-- autocommit: true

switched autocommit mode to True

## 准备工作

本文使用的样例表是一张商品表.

In [3]:
CREATE TABLE IF NOT EXISTS Commodity
(id     serial4    PRIMARY KEY,-- 商品id,
 name    VARCHAR(100) NOT NULL UNIQUE,-- 商品名
 type    VARCHAR(32)  NOT NULL, -- 商品类型
 sale_price      INT4      DEFAULT 0, -- 售价
 purchase_price  INT4      , -- 进价
 ctime     TIMESTAMPTZ  DEFAULT (now()) --商品录入的时间,默认为当前时间
)

In [4]:
SELECT column_name,column_default,is_nullable,data_type FROM information_schema.columns WHERE table_name ='commodity';

6 row(s) returned.

column_name     column_default                         is_nullable    data_type
--------------  -------------------------------------  -------------  ------------------------
id              nextval('commodity_id_seq'::regclass)  NO             integer
name                                                   NO             character varying
type                                                   NO             character varying
sale_price      0                                      YES            integer
purchase_price                                         YES            integer
ctime           now()                                  YES            timestamp with time zone

***注意: ***

1. 这张表的id字段使用的是pg的自增序列类型serial4,其值为32位整型数.自增序列在不同的数据库管理系统中定义方式不同.
2. ctime字段使用的类型是pg中带时区信息的时间戳数据,通常默认的是UTC时间,一般数据库设计的时候很容易不考虑时区问题而简单使用本地时间记录,这很容易在后续维护的时候出问题.

## 数据插入

SQL语法中使用`INSERT`来向表中插入输入,其形式如:

```SQL
INSERT INTO <表名> [(列1, 列2, 列3, ……)]VALUES (值1, 值2, 值3, ……)
```
表名后面的列清单和`VALUES`子句中的值清单的列数必须保持一致,并且一一对应.

对表进行全列`INSERT`时可以省略表名后的列清单.这时`VALUES`子句的值会默认按照从左到右的顺序赋给每一列

下面我们来插入一行数据

商品名|商品种类|商品价格|进货价格|登记日期
---|---|---|---|---
黑白宽条纹款T恤|T恤|59|30|2020-03-02 10:00:00

In [5]:
INSERT INTO Commodity ( 
    name,
    type,
    sale_price,
    purchase_price ,
    ctime
) VALUES (
    '黑白宽条纹款T恤',
    'T恤',
    59,
    30,
    '2020-03-02T10:00:00.000Z'
)

### 插入空值

插入语句可以直接为需要记为空值的列插入`NULL`,但需要注意这一列必须不能是设置了非空约束的列.比如下面的例子,由于`type`字段需要满足非空约束,因此就会报错:

In [6]:
INSERT INTO Commodity ( 
    name,
    type,
    sale_price,
    purchase_price,
    ctime
) VALUES (
    '红白宽条纹款T恤',
    NULL,
    59,
    30,
    '2020-03-02T10:00:00.000Z'
)

null value in column "type" violates not-null constraint
DETAIL:  Failing row contains (2, 红白宽条纹款T恤, null, 59, 30, 2020-03-02 10:00:00+00).

但如果是写入`sale_price`字段则没有问题,因为它没有非空约束

In [7]:
INSERT INTO Commodity ( 
    name,
    type,
    sale_price,
    purchase_price ,
    ctime
) VALUES (
    '红白宽条纹款T恤',
    'T恤',
    NULL,
    30,
    '2020-03-02T10:00:00.000Z'
)

另一种情况可以插入空值就是当我们的插入语句中不包含想插入`NULL`的字段,且该字段没有设置默认值时,这条插入语句就会自动将NULL插入该字段,上例中满足该条件的列是`purchase_price`

In [8]:
INSERT INTO Commodity ( 
    name,
    type,
    sale_price,
    ctime
) VALUES (
    '蓝白宽条纹款T恤',
    'T恤',
    59,
    '2020-03-02T10:00:00.000Z'
)

这种方式并不推荐使用,因为是隐式的,很容易在后续维护的时候出问题.

### 插入默认值

如果我们想插入默认值,那必须满足该列有设定默认值,这块可以在[DDL语法部分]()查看到.有两种方式:

1. 隐式插入
  当我们的插入语句中不包含想插入默认值的字段,且该字段有设置默认值时,这条插入语句就会自动将默认值插入该字段.
  
2. 显式插入

 通过在`VALUE`子句中显式的将`DEFAULT`写为值
 
下面我们来展示下

In [9]:
INSERT INTO Commodity ( 
    name,
    type,
    purchase_price,
    ctime
) VALUES (
    '黄白宽条纹款T恤',
    'T恤',
    30,
    DEFAULT
)

现在我们看看成果

In [10]:
SELECT * FROM Commodity WHERE type= 'T恤'

4 row(s) returned.

  id  name             type      sale_price    purchase_price  ctime
----  ---------------  ------  ------------  ----------------  --------------------------------
   1  黑白宽条纹款T恤  T恤               59                30  2020-03-02 10:00:00+00:00
   3  红白宽条纹款T恤  T恤                                 30  2020-03-02 10:00:00+00:00
   4  蓝白宽条纹款T恤  T恤               59                    2020-03-02 10:00:00+00:00
   5  黄白宽条纹款T恤  T恤                0                30  2020-07-25 06:12:05.388156+00:00

### 多行插入

SQL语法中规定一条插入语句应该对应一条数据,然而在各个数据库管理软件中为了方便使用往往会添加多行插入的语法(知名的中似乎只有Oracle不支持),这个语法基本上已经成了事实标准,因此这边也进行介绍.

其语法和单行插入很相似:

```SQL
INSERT INTO <表名> (列1, 列2, 列3, ……) 
VALUES 
(值11, 值12, 值13, ……),
(值21, 值22, 值23, ……),
(值21, 值22, 值23, ……),...
```

下面我们来插入多条短裤信息

商品名|商品种类|商品价格|进货价格|登记日期
---|---|---|---|---
米色5分裤|短裤|99|60|2020-03-05 10:00:00
黑色5分裤|短裤|99|60|2020-03-05 10:00:00
黑底白花5分裤|短裤|109|65|2020-03-05 10:00:00

In [11]:
INSERT INTO Commodity ( 
    name,
    type,
    sale_price,
    purchase_price ,
    ctime
) VALUES (
    '米色5分裤',
    '短裤',
    99,
    60,
    '2020-03-04T10:00:00.000Z'
),(
    '黑色5分裤',
    '短裤',
    99,
    60,
    '2020-03-04T10:00:00.000Z'
),(
    '黑底白花5分裤	',
    '短裤',
    109,
    65,
    '2020-03-04T10:00:00.000Z'
)

In [12]:
SELECT * FROM Commodity WHERE type= '短裤'

3 row(s) returned.

  id  name           type      sale_price    purchase_price  ctime
----  -------------  ------  ------------  ----------------  -------------------------
   6  米色5分裤      短裤              99                60  2020-03-04 10:00:00+00:00
   7  黑色5分裤      短裤              99                60  2020-03-04 10:00:00+00:00
   8  黑底白花5分裤  短裤             109                65  2020-03-04 10:00:00+00:00

## 数据的简单查询

上面的例子中我们已经使用了简单查询.

查询表中数据可以简单的使用SELECT语句,其基本结构如下:

```SQL
SELECT (列1, 列2, 列3, ……)
FROM <表名>
[
 WHERE <条件>
    
]
[
 ORDER BY (列1, 列2, 列3, ……) [DESC]
]
[
 LIMIT <行数>
]
```

其中

+ `SELECT`部分指名了需要查询的列,可以使用通配符`*`表述表中所有列
+ `FROM`部分指名了要查询的表
+ `WHERE`部分指名了要查询的结构必须满足的条件
+ `ORDER BY`部分指定了以哪一列的值来进行排序, 如果后面接上`DESC`代表按倒序排序
+ `LIMIT`部分指定了查询的行数限制,查询结果将只保留上面查到结果中的前多少行

In [13]:
SELECT * FROM Commodity WHERE type= 'T恤'

4 row(s) returned.

  id  name             type      sale_price    purchase_price  ctime
----  ---------------  ------  ------------  ----------------  --------------------------------
   1  黑白宽条纹款T恤  T恤               59                30  2020-03-02 10:00:00+00:00
   3  红白宽条纹款T恤  T恤                                 30  2020-03-02 10:00:00+00:00
   4  蓝白宽条纹款T恤  T恤               59                    2020-03-02 10:00:00+00:00
   5  黄白宽条纹款T恤  T恤                0                30  2020-07-25 06:12:05.388156+00:00

## 更新数据


更新数据可以使用语句:

```SQL
UPDATE <表名>
   SET <列名> = <表达式>;
```

比如上面例子中我们的蓝白宽条纹T恤进价是空的,我们现在可以将他填上30这个价钱

In [14]:
UPDATE Commodity
   SET purchase_price = 30

In [15]:
SELECT * FROM Commodity WHERE name='蓝白宽条纹款T恤'

1 row(s) returned.

  id  name             type      sale_price    purchase_price  ctime
----  ---------------  ------  ------------  ----------------  -------------------------
   4  蓝白宽条纹款T恤  T恤               59                30  2020-03-02 10:00:00+00:00

### 没有就有插入有就更新

SQL中在满足目标列有唯一约束时可以在INSERT语句的基础上做到数据存在就更新,不存在就插入的操作,其语法如下:

```SQL
INSERT INTO <表名> [(列1, 列2, 列3, ……)] VALUES (值1, 值2, 值3, ……)
    ON CONFLICT (列名)DO UPDATE SET <列名> = <表达式>;
```

In [16]:
INSERT INTO Commodity (
    name,
    type,
    sale_price,
    purchase_price ,
    ctime
) VALUES (
    '黑底白花5分裤',
    '短裤',
    99,
    65,
    '2020-03-04T11:00:00.000Z'
) ON CONFLICT (name) 
DO UPDATE SET 
    type='短裤',
    sale_price=99,
    purchase_price=65,
    ctime='2020-03-04T11:00:00.000Z'

In [17]:
SELECT * FROM Commodity WHERE name='黑底白花5分裤'

1 row(s) returned.

  id  name           type      sale_price    purchase_price  ctime
----  -------------  ------  ------------  ----------------  -------------------------
   9  黑底白花5分裤  短裤              99                65  2020-03-04 11:00:00+00:00

## 删除数据

删除数据通常使用`DELETE`语句,其基本语法如下:

```SQL
DELETE FROM <表名>
[WHERE <条件>]
```

如果要删除整张表的数据,就不需要`Where`子句来声明筛选条件.

如果是全部数据都要删除,可以使用专用的命令`TRUNCATE <表名>`来实现,`TRUNCATE`只能做整表删除,但它比使用`DELETE`会快很多.

In [18]:
DELETE FROM Commodity WHERE type='T恤'

In [19]:
SELECT * FROM Commodity

4 row(s) returned.

  id  name           type      sale_price    purchase_price  ctime
----  -------------  ------  ------------  ----------------  -------------------------
   6  米色5分裤      短裤              99                30  2020-03-04 10:00:00+00:00
   7  黑色5分裤      短裤              99                30  2020-03-04 10:00:00+00:00
   8  黑底白花5分裤  短裤             109                30  2020-03-04 10:00:00+00:00
   9  黑底白花5分裤  短裤              99                65  2020-03-04 11:00:00+00:00

In [20]:
TRUNCATE Commodity

In [21]:
SELECT * FROM Commodity

0 row(s) returned.

## 收尾

本篇文章介绍了最基础的增删改查操作.这也是后续复杂查询和事务操作的基础.现在我们回收商品表`Commodity`

In [22]:
DROP TABLE IF EXISTS Commodity